[
    {
        "title": "Associated Press",
        "content": "From her exile in India, Bangladesh's ousted leader Sheikh Hasina has slammed the country's upcoming election after her party was barred from the polls, remarks that could deepen tensions ahead of the pivotal vote next month.\nHasina, who was sentenced to death for her crackdown on a student uprising in 2024 that killed hundreds of people and led to the toppling of her 15-year rule, warned in an email to The Associated Press last week that without inclusive and free and fair elections, Bangladesh will face prolonged instability.\nShe also claimed that Bangladesh's interim government led by Nobel Peace Prize laureate Muhammad Yunus deliberately disenfranchised millions of her supporters by excluding her party - the former ruling Awami League - from the election.",
        "url": "https://thehimalayantimes.com/world/bangladeshs-ousted-leader-hasina-denounces-the-upcoming-election-from-her-exile-in-india",
        "scraped_at": "2026-01-31T21:46:03.349114"
    },
    {
        "title": "Associated Press",
        "content": "MELBOURNE, JANUARY 30\nNovak Djokovic finally beat one of the two men who've been blocking his path to an unprecedented 25th Grand Slam singles title when he edged Jannik Sinner in five sets to reach the Australian Open final Friday.\nTo get that coveted No. 25, he'll have to beat the other: Top-ranked Carlos Alcaraz.\nThey're both chasing history in Sunday's championship decider, with Alcaraz striving to become the youngest man at 22 ever to complete a career Grand Slam.",
        "url": "https://thehimalayantimes.com/sports/history-chasing-djokovic-and-alcaraz-to-meet-in-australian-open-final-after-epic-wins",
        "scraped_at": "2026-01-31T21:46:05.188101"
    },
    {
        "title": "THT Online",
        "content": "KATHMANDU, JANUARY 31\nSingapore Airlines (SIA) will operate wide-body aircraft on two of its seven weekly flights between Singapore and Kathmandu during Nepal's spring season from March to April 2026 to meet increased passenger demand.\nAccording to the airline, the wide-body aircraft will be deployed on flights operating on Wednesdays and Fridays between March 4 and April 24, while the remaining flights will continue using narrow-body aircraft.\nThe wide-body aircraft has a seating capacity of 337, including 36 Business Class and 301 Economy Class seats.",
        "url": "https://thehimalayantimes.com/business/singapore-airlines-to-deploy-wide-body-aircraft-on-kathmandu-route-in-spring",
        "scraped_at": "2026-01-31T21:46:08.365716"
    },
    {
        "title": "THT Online",
        "content": "KATHMANDU, JANUARY 31\nBaglung district has produced oranges worth around Rs 270 million this year, marking an increase of Rs 4.4 million compared to last year.\nThe rise in production has been attributed to increased farmer interest in orange cultivation, protection of saplings from pests, and timely rainfall, according to the Agriculture Knowledge Centre, Baglung. This year, the district produced 4,169 metric tons of oranges, sold at a minimum price of Rs 65 per kilogram.\nKnowledge Centre Chief Kumar Pun Magar said orange farming has expanded even to previously barren land and villages affected by outbound migration. The area under orange cultivation has increased from 585 hectares in 2019 to 664 hectares this year, with production currently spread across 381 hectares.",
        "url": "https://thehimalayantimes.com/business/baglung-produces-oranges-worth-around-rs-270-million",
        "scraped_at": "2026-01-31T21:46:11.411821"
    },
    {
        "title": "Mausam Shah 'Nepali'",
        "content": "KATHMANDU, JANUARY 30\nFollowing reports of widespread defoliation in sal (Shorea robusta) forests in Dailekh district, the Forest Research and Training Centre (FRTC), under the Ministry of Forests and Environment, has conducted a field investigation to determine the causes.\nA three-member team led by Sunita Ulak, Undersecretary at FRTC, included Dr. Prem Budha, an entomologist at Tribhuvan University, and FRTC researcher Pratik Pandey. The study was carried out in coordination with the Ministry of Industry, Tourism, Forests and Environment of Karnali Province, the Karnali Province Forest Directorate, and the Forest Division Office in Dailekh.\nLocal accounts from Kimugaun Community Forest indicate that a similar outbreak occurred approximately three years ago but subsided naturally following timely winter rainfall.",
        "url": "https://thehimalayantimes.com/nepal/what-is-causing-defoliation-in-shorea-robusta-in-nepals-dailekh-district",
        "scraped_at": "2026-01-31T21:46:14.253113"
    },
    {
        "title": "THT Online",
        "content": "KATHMANDU, JANUARY 31\nWith 33 days remaining until the March 5 House of Representatives elections, the Election Commission (EC) has stepped up monitoring to ensure strict enforcement of the Election Code of Conduct, 2082.\nThe EC has so far sought explanations from 21 political parties, candidates and organizations based on complaints received by the Central Code of Conduct Monitoring Committee. Responses have been received for only five cases, while follow-ups are ongoing for the remaining complaints.\nThe Commission is also monitoring misinformation, disinformation and hate speech in coordination with regulatory bodies. According to EC Spokesperson Narayan Prasad Bhattarai, the Information Integrity Promotion Unit under the Election Information Coordination Centre has forwarded 302 cases of identified misinformation to concerned authorities for action under prevailing laws.",
        "url": "https://thehimalayantimes.com/nepal/ec-intensifies-code-of-conduct-enforcement",
        "scraped_at": "2026-01-31T21:46:16.485877"
    },
    {
        "title": "THT Online",
        "content": "KATHMANDU, JANUARY 31\nThe Birgunj Customs Office recorded food imports worth Rs 11.57 billion in the first half of the current fiscal year 2082/83 BS, slightly lower than the corresponding period of the previous fiscal year.\nAccording to information officer Uday Singh Bista, rice imports amounted to 150.43 million kilograms valued at Rs 5.68 billion, down from Rs 6.9 billion during the same period last year. Overall food imports in the first six months of the previous fiscal year stood at Rs 11.78 billion.\nSimilarly, maize worth Rs 3.41 billion was imported during the review period. Imports of rice under another category totalled Rs 1.61 billion, while malt imports were valued at Rs 330 million. Buckwheat, millet and other grains accounted for imports worth Rs 237.03 million.",
        "url": "https://thehimalayantimes.com/business/birgunj-customs-records-food-imports-worth-rs-1157-billion-in-first-half-of-fy-208283",
        "scraped_at": "2026-01-31T21:46:19.117554"
    },
    {
        "title": "THT Online",
        "content": "KATHMANDU, JANUARY 31\nThe Election Commission (EC) on Friday unveiled sample ballot papers for all districts and electoral constituencies ahead of the March 5 House of Representatives elections, as part of its voter education initiative.\nThe EC has designed two types of ballot papers-one for districts with a single constituency and another for districts with multiple constituencies. According to EC Spokesperson Narayan Prasad Bhattarai, the size of the ballot paper will vary depending on the number of candidates contesting in each constituency.\nKathmandu district, which has the highest number of constituencies at ten, will have the largest ballot paper in the country. In contrast, districts with only one constituency-including Salyan, Dolpa, Mugu, Jumla, Kalikot, Humla, Jajarkot, Rukum (Paschim), Bajura, Bajhang, Doti, Darchula, Baitadi and Dadeldhura-will use smaller ballot papers.",
        "url": "https://thehimalayantimes.com/nepal/sample-ballot-papers-unveiled-kathmandu-to-have-largest-size",
        "scraped_at": "2026-01-31T21:46:21.905523"
    },
    {
        "title": "THT Online",
        "content": "KATHMANDU, JANUARY 31\nDaraz Nepal has announced its '2.2 Fabulous February' sale, offering discounts of up to 70 percent across multiple product categories.\nThe campaign will run from February 1 to February 6.\nAccording to the company, the sale includes flash deals, brand-specific offers, free delivery on select items, and Everyday Low Price options on essential goods.",
        "url": "https://thehimalayantimes.com/nepal/daraz-announces-22-fabulous-february-sale-with-discounts-up-to-70",
        "scraped_at": "2026-01-31T21:46:23.649663"
    },
    {
        "title": "THT Online",
        "content": "KATHMANDU, JANUARY 31\nBlue Water Intelligence (BWI) has launched machine learning-enabled river flow forecasting and early warning services in Nepal under the HydroNepal Project, marking a milestone in Nepal–France cooperation on water and energy security.\nThe system is now operational in the Upper Karnali, Marsyangdi, Trishuli, and Dudh Koshi river basins.\nThe project, supported by the French government and implemented with the Nepal Electricity Authority as a partner, aims to strengthen hydropower planning, disaster preparedness, and water resource management.",
        "url": "https://thehimalayantimes.com/kathmandu/nepalfrance-collaboration-launches-ai-based-river-flow-forecasting-system",
        "scraped_at": "2026-01-31T21:46:26.986002"
    }
]