[
    {
        "title": "EC unveils sample ballot papers",
        "content": "KATHMANDU, Jan 31: Election Commission (EC) has made public sample ballot papers for various districts and electoral constituencies as a part of its ongoing preparation to hold the March 5 election to the House of Representatives (HoR).\nThe EC released the sample ballot papers covering all seven provinces, aiming to support voter education ahead of the election.\nTwo types of ballot papers have been designed—one for districts with a single electoral constituency and another for those with multiple constituencies, said Narayan Prasad Bhattarai, spokesperson at the EC.Spokesperson Bhattarai further mentioned that the size of the ballot paper depends on the number of candidates contesting in each constituency.\nHe explained that constituencies with a larger number of candidates will have comparatively bigger ballot papers, while those with fewer candidates will have smaller ones.",
        "url": "https://myrepublica.nagariknetwork.com/news/ec-unveils-sample-ballot-papers-77-46.html",
        "scraped_at": "2026-01-31T22:10:32.781028"
    },
    {
        "title": "EC takes action against 302 cases of disinformation and hate speech",
        "content": "KATHMANDU, Jan 31: The Election Commission (EC) has taken action against 302 instances of misinformation, disinformation, and hate speech in violation of the election code of conduct, ahead of the March 5 House of Representatives election.\nAssistant Spokesperson Kul Bahadur GC told RSS that the Information Ethics Promotion Unit, under the Election Information Dissemination and Coordination Center, forwarded the cases to relevant authorities for action under the Election Code of Conduct, 2082, the Electronic Transactions Act, 2063, and the Press Council Act, 2048.\nThe Election Code of Conduct, 2082, came into effect at 12:00 PM on January 18 to ensure a fair, transparent, and credible election. Authorities are also receiving complaints from political parties, candidates, organizations, and individuals, and are seeking clarifications from those allegedly involved in violations.\nGC added that any activity threatening the integrity or credibility of the elections can be reported in writing, verbally, or electronically to the Election Commission or the offices of the Chief Returning Officer, Returning Officer, Provincial/District Election Office, or District Code of Conduct Monitoring Officer.",
        "url": "https://myrepublica.nagariknetwork.com/news/ec-takes-action-against-302-cases-of-disinformation-and-hate-speech-26-85.html",
        "scraped_at": "2026-01-31T22:10:33.797242"
    },
    {
        "title": "Oli asks SC to deliver a speedy verdict on parliament restoration",
        "content": "KATHMANDU, Jan 31: CPN-UML Chairman KP Sharma Oli has called on the Supreme Court (SC) to quickly decide on the writ petition filed against the dissolution of the House of Representatives (HoR).\nAddressing a programme organised by the Okhaldhunga–Kathmandu Liaison Forum in the capital on Saturday for the March 5 election, Oli sought clarity on whether elections will be held on the stipulated date. While arguing that the apex court cannot remain silent on the dissolution of parliament, he urged the court to deliver the verdict as soon as possible.\n“The court must immediately decide whether elections will be held or the parliament restored. The constitution has been violated, and the court must speak. However, we will accept the court’s decision whether it says the constitution has or hasn’t been violated,” Oli said.\nOli added that the court should give its ruling before elections, warning that remaining silent during a constitutional crisis would undermine the court’s legitimacy.",
        "url": "https://myrepublica.nagariknetwork.com/news/oli-asks-sc-to-deliver-a-speedy-verdict-on-parliament-restoration-37-78.html",
        "scraped_at": "2026-01-31T22:10:34.834666"
    },
    {
        "title": "Beyond Aid: How Japan Built Trust in Nepal",
        "content": "“A virtuous and generous person always bows;where is the branch of a fruit-laden tree that does not bend?”\n— Poet Laureate Lekhnath Paudyal\nThose lines seemed to come alive on the face of Matsuzaki Mizuki.\nIn the hills of Syangja, orange orchards stood heavy with ripened fruit, their branches bending under abundance. Like those branches, Matsuzaki spoke to visitors with a gentle bow—free of formality, untouched by the arrogance of rank. There was no distance, no authority asserted—only quiet humility.",
        "url": "https://myrepublica.nagariknetwork.com/news/a-good-japanese-74-13.html",
        "scraped_at": "2026-01-31T22:10:35.874554"
    },
    {
        "title": "Oli warns of election bias, vows to reject rigged results",
        "content": "KATHMANDU, Jan 31: In a sharp warning to the government, CPN-UML Chairman KP Sharma Oli has declared that his party will not accept the results of the upcoming House of Representatives (HoR) election if there is any hint of government bias or manipulation.\nSpeaking at a programme organised by the Okhaldhunga–Kathmandu Contact Forum on Saturday, Oli questioned the government’s intentions and raised concerns over recent administrative reshuffles, which he said were aimed at influencing electoral outcomes.\n“If the government tries to favour someone or ensure their victory, such an election will not be accepted. We will reject the poll outcomes, and its results will not be legitimate,” Oli said, leaving no doubt about his party’s stance.\nHe cautioned that any attempt to turn the elections into a political disaster would only harm the country. “Any act of government partisanship, attempts to make someone win or lose, would bring only harm to Nepal,” he warned.",
        "url": "https://myrepublica.nagariknetwork.com/news/oli-warns-of-election-bias-vows-to-reject-rigged-results-36-19.html",
        "scraped_at": "2026-01-31T22:10:36.943167"
    },
    {
        "title": "NC Prez Thapa expresses confidence to hold regular general convention before provincial, local polls",
        "content": "KATHMANDU, Jan 31: Nepali Congress (NC) President Gagan Thapa has said the party will complete its regular general convention before the upcoming provincial and local elections.\nSpeaking during an interaction with party workers of Kathmandu constituency no. 4 on Saturday, Thapa said the new convention would mark a shift toward distributing election tickets from the grassroots level.\nEmphasizing internal reforms, Thapa said party leaders would no longer need to lobby the homes of the party president or general secretaries for tickets. He added that factionalism within the party has ended, declaring that the long-standing “60–40” power-sharing practice is now a thing of the past.\nThapa further stated that NC would avoid power-sharing both within the party and externally, ensuring equal treatment for all members. Stressing that the party is moving toward change, he said a transformed Congress is committed to transforming Nepal.",
        "url": "https://myrepublica.nagariknetwork.com/news/nc-prez-thapa-expresses-confidence-to-hold-regular-general-convention-befor-63-15.html",
        "scraped_at": "2026-01-31T22:10:37.978732"
    },
    {
        "title": "NC to deploy central mechanism for elections",
        "content": "KATHMANDU, Jan 31:Keeping in view ofthe upcoming election on March 5, the Nepali Congress (NC) has decided to deploy its central office-bearers and members across all districts and constituencies.\nSpeaking at a press conference held at the NC Central Office in Sanepa on Saturday, NC Spokesperson Devraj Chalise said that all central-level office-bearers and members of the party would be mobilised at district and constituency levels to ensure effective results in the elections.\nSpokesperson Chalise also said that political institutions endorsed by the people never become old; only individuals grow old over time. “A party does not become old; it is ideas that must be renewed and leadership that must be refreshed,” he said. “Across the world, new leadership emerges within old parties and that process builds a trustworthy future.”",
        "url": "https://myrepublica.nagariknetwork.com/news/nc-to-deploy-central-mechanism-for-elections-17-63.html",
        "scraped_at": "2026-01-31T22:10:38.996363"
    },
    {
        "title": "Gold price rallies down from record high of Rs 339,300 per tola; overall gain records Rs 15,000 in a week",
        "content": "KATHMANDU, Jan 31: The price of gold in the domestic market increased Rs 15,000, while it reached the historic high of Rs 339,300 per tola (11.6638 grams) in a week.\nAccording to the Federation of Nepal Gold and Silver Dealers’ Association (FENEGOSIDA), the market price of gold increased to Rs 318,800 from Rs 301,400 per tola when the market closed the previous week. On Sunday, the market started the weekday trading by adding Rs 2,400.\nOn Monday, it added Rs 5,200, followed by an addition of Rs 300 and Rs 9,500 on the consecutive two days. On Thursday, the price of precious yellow metal jumped Rs 20,500 per tola, perhaps the highest single day gain as of now. On Friday, the price however corrected by Rs 20,500 to close for the week.\nAccording to FENEGOSIDA, the gold price surged due persisting geopolitical tensions along with an increased disagreement between Iran and the USA. In addition, the central banks of a number of countries continued to purchase more gold, which posted high demand for the precious metal, raising the price to the highest level.",
        "url": "https://myrepublica.nagariknetwork.com/news/gold-price-rallies-down-from-record-high-of-rs-339300-per-tola-overall-gain-96-19.html",
        "scraped_at": "2026-01-31T22:10:39.912574"
    },
    {
        "title": "NC urges not to turn the country into a laboratory in the name of ‘new tests’",
        "content": "KATHMANDU:Nepali Congress (NC) is set to incorporate ‘Vision–10’ in its election manifesto for the upcoming polls.\nSpeaking at a press conference held at the party office in Sanepa on Saturday, party spokesperson Devaraj Chalise said the manifesto would reflect the country’s ground realities, with a focus on good governance, development and practical action plans.\nAccording to Chalise, the Congress manifesto will not be limited to aspirations and commitments alone. It will also clearly outline the resources, means and mechanisms required for effective implementation. “The manifesto will not just list programmes; it will also specify how resources will be mobilised to implement them,” he said.\nHe informed that the party is currently collecting suggestions from districts across the country as part of the manifesto-drafting process. Inputs from local levels, constituencies and districts will be consolidated and aligned with national priorities. “The Congress will bring a manifesto that reflects its capacity, practicality and implementable programmes,” he said, adding that it would seek to incorporate the sentiments of all classes, regions and communities.",
        "url": "https://myrepublica.nagariknetwork.com/news/nc-urges-not-to-turn-the-country-into-a-laboratory-in-the-name-of-new-tests-67-87.html",
        "scraped_at": "2026-01-31T22:10:40.889916"
    },
    {
        "title": "Jhapa-5: Balen’s hope rest on swing votes as numbers favor Oli",
        "content": "KATHMANDU, Jan 22: During his tenure as mayor of Kathmandu Metropolitan City, Balendra Shah (Balen) was locked in his fiercest confrontation with the CPN-UML. The clashes frequently spilled onto social media, where Balen launched sharp, often biting satire against UML Chair KP Sharma Oli. Oli, for his part, responded with open anger from public platforms.\nThat long-running war of words has now shifted from rhetoric to the electoral arena. By joining the Rastriya Swatantra Party (RSP), Balen has entered Oli’s traditional stronghold—Jhapa Constituency-5. Rallying forces described as “alternative,” the RSP has projected Balen as a potential future prime minister. The contest has thus taken on larger symbolism: a face-off between Oli, the standard-bearer of the old political order, and Balen, the most prominent figure among the new forces—making it the most closely watched battle of the March 5 House of Representatives (HoR) election.\nOn Tuesday, as he filed his candidacy, Balen appeared to transport nationwide political energy to Damak, Jhapa. Accompanied by tens of thousands of supporters, he reached the election officer’s office in Jhapa-5 and formally challenged Oli. The sheer scale of the crowd has fueled speculation, both at home and abroad, that Balen could deal a serious blow to Oli on his own turf.\nYet Jhapa-5—shaped by the legacy of the “Jhapa Movement,” known as a bastion of communist voters, and long regarded as Oli’s political fortress—is far from an easy battlefield. Oli’s record of commanding, often one-sided victories in recent elections presents a formidable hurdle for Balen.",
        "url": "https://myrepublica.nagariknetwork.com/news/jhapa-5-balens-hope-rest-on-swing-votes-as-numbers-favor-oli-41-68.html",
        "scraped_at": "2026-01-31T22:10:41.945288"
    }
]